err_number = {
    '0':"成功",
    '0996':"Base64编码错误",
    '0997':"json error",
    '0998':"Python中数据执行异常",
    '9999':"存储过程执行异常",
    '1000':"非法操作",
    '1001':"失败",
    '1002':"token失效",
    '1003':"验证码错误",
    '1004':"您的联系方式未绑定",

    '1006':"请求信息错误",
    '1007':"无效信息",

    '1005':"不能向自己发送申请",
    '1008':"已经互为球友",
    '1009':"未同意对方请求",

    '1010':"该记录不存在",
    '1011':"该权限不能删除",
    '1012':"该角色不能删除",
    '1013':"角色不存在",
    '1014':"权限不存在",
    '1015':"角色与权限已绑定",
    '1016':"角色与权限未绑定",
    '1017':"角色已存在",
    '1018':"权限已存在",
    '1021':"发送短信失败",
    '1022':"请不要重复发送验证码",
    '1031':"文件路径有误",
    '1032':"邮箱已经存在",
    '1033':"手机已经存在",
    '1034':"帐号已被绑定",
    '1035':"您尚未登录，请重新登录",
    '1036':"邮箱尚未激活，请激活后登录",

    '1045':'对账查询失败',
    '1046':'微信支付失败',
    '1047':'支付金额不能低于1分钱',

    '1051':'角色名不能以数字开头',
    '1052':'手机号不正确',

    '1054':'查询数据失败',
    '1055':'添加失败',
    '1056':'删除失败',
    '1057':'更新失败',

    '1058':'姓名与该账号姓名不匹配',
    '1059':'求和有误',
    '1060':'已绑定银行卡',
    '1061':'支付失败',
    '1062':'角色不能大于10个',
    '1063':'手机号不能为空',
    '1070':'无效的地址信息',


    '1075':'用户不存在',
    '1076':'姓名已存在',
    '1077':'账号已存在',
    '1078':'未知用户类型',
    '1079':'验证码不能为空',


    '10000':'测试',


    # ML
    '2000':'账号不存在',
    '2001':'您的账号已被禁用',
    '2002':'该用户已绑定银行卡，不能重复绑定',
    '2003':'钱包余额不足',
    '2004':'银行卡信息不匹配',
    '2005':'不在归还时间内，不能归还',
    '2006':'请先去绑定银行卡！',
    '2017':'抱歉,钱包余额满10元才能提现',
    '2018':'抱歉,提现金额满10元才能提现',
    '2019':'您的商家已经认证成功',

    '2022':'对不起，您没有权限执行该操作',
    '2023':'抱歉，每周只能提现1次',
    '2024':'您已经是会员',

    # 上架 推荐
    '2008' :'推荐已超过数量',
    '2012' :'未知上架状态',
    '2013' :'未知状态',
    '2014' :'请耐心等待用户完善信息之后再审核',
    # 文件
    '2009' : '文件删除失败',
    '2010' : '文件格式错误',
    '2011' : '文件上传失败',
    '2016' : '审核原因不能为空',

    '2101' :  '未做出任何修改',
    '2102' :  '条件为空',
    '2103' :  '已关联',

    # 注册登录和修改密码
    '3000':'账号不能为空',
    '3001':'密码不能为空',
    '3002':'账号不存在',
    '3003':'添加失败',
    '3004':'添加成功',
    '3005':'账号/密码错误',
    '3006':'登陆成功',
    '3007':'密码不同请重新输入',
    '3008':'修改成功',
    '3009':'修改失败',
    '3010':'不能使用原密码,请重新输入',
    '3100':'未知第三方',
    '3101':'未知第三方id',
    '3102':'未知用户',
    '3103':'当前状态不能提交审核',
    # 位置提示
    '3011':'该地区已存在维修中心',
    '3012':'未确定您的坐标，请重新定位',
    '3016':'优惠券号码已用',
    '3017':'优惠券号码已用',

    # 订单
    '3015':'没有所需的内容',
    '3018':'退款失败',
    '3019':'商户余额不足',
    '3021':'未知订单',
    '3022':'抢单失败',
    '3023':'该提现请求已经审核',
    '3024':'您选择的有已经审核的数据，请重新选择',

    # 消息提示
    '3050':'推送内容不能为空',
    '3051':'推送方式不能为空',
    '3052':'未知消息',

    # 活动提示
    '3150' :'无效的活动',
    '3151' :'活动时间冲突，请重新选择活动时间',
    '3152' :'该时间段内已有活动上架',
    '3153' :'抱歉，未找到该活动相关信息',

    # token
    '5001' : '生成token失败',
    '5002' : '该账号不存在',
    '5003' : '无效的用户信息',

    # 意见反馈
    '6000' :'该意见反馈类型已存在',
    '6001' :'问题类型名称不能为空',

}